In [1]:
-import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [3]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [4]:
#딕셔너리를 데이터프레임으로 만들면 키 값이 데이터프레임에 열 이름, 밸류값이 데이터

In [5]:
frame.head() #위부터 5개

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [6]:
frame.tail() #아래부터 5개

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [7]:
df=frame.head(3) #위부터 3개

In [8]:
df

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [10]:
pd.DataFrame(data, columns=["year", "state", "pop"]) #열 순서 변경

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [12]:
frame2=pd.DataFrame(data, columns=["dept", "year", "state", "pop"]) #새로운 열 추가
frame2

  dept  year   state  pop
0  NaN  2000    Ohio  1.5
1  NaN  2001    Ohio  1.7
2  NaN  2002    Ohio  3.6
3  NaN  2001  Nevada  2.4
4  NaN  2002  Nevada  2.9
5  NaN  2003  Nevada  3.2

In [13]:
frame2.columns #데이터 열값만 출력

Index(['dept', 'year', 'state', 'pop'], dtype='object')

In [15]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [19]:
frame2.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [18]:
frame2.loc[1] #행 인덱스 번호를 사용해서 참조하려고 하면 사용

dept      NaN
year     2001
state    Ohio
pop       1.7
Name: 1, dtype: object

In [20]:
#1차원 : 리스트, 배열(벡터), 시리즈(벡터)
#2차원 : 리스트의 리스트, 밸열(벡터), 데이터프레임

In [21]:
frame2.iloc[2] #묵시적인 인덱스 번호를 사용

dept      NaN
year     2002
state    Ohio
pop       3.6
Name: 2, dtype: object

In [23]:
type(frame2.iloc[2])

pandas.core.series.Series

In [25]:
frame2["dept"]=16.5
frame2

   dept  year   state  pop
0  16.5  2000    Ohio  1.5
1  16.5  2001    Ohio  1.7
2  16.5  2002    Ohio  3.6
3  16.5  2001  Nevada  2.4
4  16.5  2002  Nevada  2.9
5  16.5  2003  Nevada  3.2

In [27]:
frame2["dept"]=np.arange(10,16)
frame2

   dept  year   state  pop
0    10  2000    Ohio  1.5
1    11  2001    Ohio  1.7
2    12  2002    Ohio  3.6
3    13  2001  Nevada  2.4
4    14  2002  Nevada  2.9
5    15  2003  Nevada  3.2

In [28]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [29]:
frame2["dept"]=val
frame2

   dept  year   state  pop
0   NaN  2000    Ohio  1.5
1   NaN  2001    Ohio  1.7
2   NaN  2002    Ohio  3.6
3   NaN  2001  Nevada  2.4
4   NaN  2002  Nevada  2.9
5   NaN  2003  Nevada  3.2

In [31]:
frame2["state"]=="Ohio"

0     True
1     True
2     True
3    False
4    False
5    False
Name: state, dtype: bool

In [32]:
frame2[frame2["state"]=="Ohio"] #원하는 데이터 프레임만 출력

   dept  year state  pop
0   NaN  2000  Ohio  1.5
1   NaN  2001  Ohio  1.7
2   NaN  2002  Ohio  3.6

In [33]:
frame2[frame2["state"]=="Ohio"]["year"]

0    2000
1    2001
2    2002
Name: year, dtype: int64

In [ ]:
frame2["state"]=="Ohio"
#feature engineering (특성공학) : 파생변수를 생성
#derived variable(파생변수) : 기존의 변수들로 부터 새롭게 생성되어지는 변수

In [34]:
frame2["eastern"]=frame2["state"]=="Ohio"
frame2

   dept  year   state  pop  eastern
0   NaN  2000    Ohio  1.5     True
1   NaN  2001    Ohio  1.7     True
2   NaN  2002    Ohio  3.6     True
3   NaN  2001  Nevada  2.4    False
4   NaN  2002  Nevada  2.9    False
5   NaN  2003  Nevada  3.2    False

In [35]:
del frame2["eastern"]
frame2

   dept  year   state  pop
0   NaN  2000    Ohio  1.5
1   NaN  2001    Ohio  1.7
2   NaN  2002    Ohio  3.6
3   NaN  2001  Nevada  2.4
4   NaN  2002  Nevada  2.9
5   NaN  2003  Nevada  3.2

In [36]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}

In [41]:
frame3=pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [42]:
frame3.loc[0] #0 이라는 키가 존재하지 않음

KeyError: 0

In [44]:
frame3.iloc[0] #묵시적 0번

Ohio      1.5
Nevada    NaN
Name: 2000, dtype: float64

In [45]:
frame3.loc[2000]

Ohio      1.5
Nevada    NaN
Name: 2000, dtype: float64

In [46]:
frame3.iloc[2]

Ohio      3.6
Nevada    2.9
Name: 2002, dtype: float64

In [47]:
frame3.iloc[-1]

Ohio      3.6
Nevada    2.9
Name: 2002, dtype: float64

In [48]:
populations

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

In [50]:
pd.DataFrame(populations)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [51]:
pd.DataFrame(populations, index=[2000,2001,2002])

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [52]:
pd.DataFrame(populations, index=[1999,2000,2001,2002,2003]) #인덱스 직접 설정

      Ohio  Nevada
1999   NaN     NaN
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [53]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [55]:
frame3["Ohio"][:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [56]:
frame3["Nevada"][:2]

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [57]:
pd.DataFrame({"Ohio":frame3["Ohio"][:-1],
"Nevada":frame3["Nevada"][:2]})

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [58]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [59]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [60]:
#파이썬-리스트,튜플,딕셔너리,집합
#넘파이-배열(1차원(벡터),2차원(행렬),3차원...)(리스트보다 연산 속도 빠름)
#판다스-데이터프레임(2차원),시리즈(1차원)

In [61]:
frame2

   dept  year   state  pop
0   NaN  2000    Ohio  1.5
1   NaN  2001    Ohio  1.7
2   NaN  2002    Ohio  3.6
3   NaN  2001  Nevada  2.4
4   NaN  2002  Nevada  2.9
5   NaN  2003  Nevada  3.2

In [63]:
frame2.to_numpy()

array([[nan, 2000, 'Ohio', 1.5],
       [nan, 2001, 'Ohio', 1.7],
       [nan, 2002, 'Ohio', 3.6],
       [nan, 2001, 'Nevada', 2.4],
       [nan, 2002, 'Nevada', 2.9],
       [nan, 2003, 'Nevada', 3.2]], dtype=object)

In [64]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])
obj

a    0
b    1
c    2
dtype: int32

In [65]:
obj.loc["a"]

0

In [66]:
obj.iloc[0]

0

In [67]:
obj

a    0
b    1
c    2
dtype: int32

In [68]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [69]:
obj.index[1:]

Index(['b', 'c'], dtype='object')

In [73]:
obj2=pd.Series([1.5, -2.5, 0], index=np.arange(100,103))
obj2

100    1.5
101   -2.5
102    0.0
dtype: float64

In [74]:
obj2.index

Int64Index([100, 101, 102], dtype='int64')

In [75]:
101 in obj2.index

True

In [76]:
103 in obj2.index

False

In [77]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [78]:
2003 in frame3.index

False

In [80]:
"California" in frame3.columns

False

In [81]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [82]:
obj.reindex(["a","b","c","d","e"])

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [83]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [84]:
obj3.reindex([0,1,2,3,4,5])

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [85]:
obj3.reindex(np.arange(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [87]:
obj3.reindex(np.arange(6), method="ffill") #forward 위-> 아래

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [88]:
obj3.reindex(np.arange(6), method="bfill") #backward 아래-> 위

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [ ]:
#결측값 대체 알고리즘 : ffill, bfill, 보간법, 회귀, knn,...

In [89]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [90]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [91]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"]) # 5. float 형식
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [92]:
new_obj = obj.drop("c") #일시적으로 제거

In [93]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [94]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [95]:
obj.drop("c", inplace=True) #inplace=True 제거된 상태로 저장

In [96]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [97]:
obj.drop(["a", "d"]) #여러개의 행을 추출하려면 리스트 구조로 입력

b    1.0
e    4.0
dtype: float64

In [98]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [99]:
data.loc["Colorado"]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [100]:
data.loc[["Colorado","Ohio"]] #여러개의 행을 추출하려면 리스트 구조로 입력

          one  two  three  four
Colorado    4    5      6     7
Ohio        0    1      2     3

In [102]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [103]:
data[["two","four"]]

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [104]:
data.drop(["Colorado","Ohio"]) #drop 함수로 행 제거

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [105]:
data.drop(index=["Colorado","Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [107]:
data.drop("two", axis=1) #drop 함수로 열 제거

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [108]:
data.drop(["two"], axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [109]:
data.drop("two", axis="columns")

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [111]:
data.drop(columns="two")

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [112]:
data.drop(columns=["one", "three"])

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [113]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [114]:
obj["b"]

1.0

In [115]:
obj.loc["b"]

1.0

In [116]:
obj[1]

1.0

In [117]:
obj.iloc[1]

1.0

In [118]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [119]:
obj.iloc[2:4]

c    2.0
d    3.0
dtype: float64

In [120]:
obj[[1,3]] #떨어져 있는 것 참조할 때 대괄호로 묶기

b    1.0
d    3.0
dtype: float64

In [123]:
#obj에서 2보다 작은 데이터 추출
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [124]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [125]:
obj1

2    1
0    2
1    3
dtype: int64

In [127]:
obj1.loc[1]

3

In [129]:
obj1.iloc[2]

3

In [130]:
obj1.iloc[[2,0]]

1    3
2    1
dtype: int64

In [131]:
obj2

a    1
b    2
c    3
dtype: int64

In [132]:
obj2.iloc[1:2] #2는 포함 안함

b    2
dtype: int64

In [133]:
obj2.loc["b":"c"] #"c"까지 포함

b    2
c    3
dtype: int64

In [134]:
obj2.loc["b":"c"]=99

In [135]:
obj2

a     1
b    99
c    99
dtype: int64

In [136]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [137]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [144]:
#three 열 값이 5보다 큰데이터를 추출
data[data["three"]>5]["three"]

Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

In [145]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [147]:
data.loc["Colorado"]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [149]:
data.loc["Colorado"]

two      5
three    6
Name: Colorado, dtype: int32

In [150]:
data.loc["Colorado","two"]

5

In [151]:
data.loc["Colorado",["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [152]:
data.iloc[1]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [153]:
data.iloc[1:3]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11

In [154]:
data.iloc[1:3]["four"]

Colorado     7
Utah        11
Name: four, dtype: int32

In [156]:
data.iloc[1:3, 3]

Colorado     7
Utah        11
Name: four, dtype: int32

In [157]:
data.iloc[1:3][["four","one"]]

          four  one
Colorado     7    4
Utah        11    8

In [158]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [161]:
data[:3]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [162]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [167]:
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [168]:
data.three>=2

Ohio        True
Colorado    True
Utah        True
New York    True
Name: three, dtype: bool

In [169]:
data.loc[data.three>=2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [170]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [172]:
ser.iloc[-1]

2.0

In [173]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [175]:
data["one"]=1

In [176]:
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [178]:
data.iloc[2]=555

In [179]:
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah      555  555    555   555
New York    1   13     14    15

In [197]:
#data의 four열 값이 5보다 크면 모두 100으로 변경
data[data["four"]>5]=100

TypeError: unhashable type: 'Series'

In [195]:
data

          one  two  three  four
Ohio        1    1      2     3
Colorado  100  100    100   100
Utah      100  100    100   100
New York  100  100    100   100

In [199]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=["a", "c", "e", "f", "g"])

In [200]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [201]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [202]:
s1+s2 #공통으로 있는 행만 연산

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [203]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                   index=["Ohio", "Texas", "Colorado"])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])

In [204]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [205]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [206]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [207]:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})

In [208]:
df1

   A
0  1
1  2

In [209]:
df2

   B
0  3
1  4

In [210]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN

In [211]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list("abcde"))

In [212]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [213]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [219]:
df2.iloc[1]["b"]

6.0

In [220]:
df2.iloc[1:2,1:2] #범위로 주면 데이터프레임 형식으로 출력

     b
1  6.0

In [222]:
df2.loc[1,"b"]=np.nan

In [223]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [224]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [225]:
df1+df2 #nan과 연산하면 결과값은 nan

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [226]:
df1.add(df2)

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [227]:
df1.add(df2,fill_value=0) #데이터값이 없는 곳을 0으로 채워라

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [228]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [229]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [230]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [231]:
arr[0]

array([0., 1., 2., 3.])

In [232]:
arr[0].shape

(4,)

In [233]:
arr.shape

(3, 4)

In [234]:
arr-arr[0] #브로드캐스팅 1차원구조가 2차원구조로 변경 후 연산

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [235]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

In [236]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [239]:
ser=frame.iloc[0]
ser

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [240]:
frame-ser

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [241]:
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int32

In [242]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [244]:
df=pd.read_csv("titanic/train.csv")
df
#df에서 나이(Age)가 70세 이상인 사람의 데이터를 추출

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [248]:
df[df["Age"]>=70]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5000,NaN,S
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0000,B22,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

In [252]:
#1
df[df["Embarked"]=="C"]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
866,867,1,2,"Duran y More, Miss. Asuncion",female,27.0,1,0,SC/PARIS 2149,13.8583,NaN,C
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [269]:
#2
df[df["SibSp"]+df["Parch"]==0]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [263]:
#3
df[df["Pclass"]==1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [288]:
#4
df[(df["Fare"]>=20) & (df["Fare"]<50)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [286]:
df.Fare>=20 and df.Fare<50

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().